<template xmlns:v-bind="http://www.w3.org/1999/xhtml">
  <div id="app">
    <header class="container-fluid sticky-top">
      <div class="row mb-3">
        <select id="actions" class="form-control" style="border-bottom: 10px solid aqua" data-style="btn-primary"
                data-size="6" v-model="mode">
          <option class="menu" value="stats">Stats</option>
          <option class="menu" value="energyBalanceCalculation">Energy Balance Calculation</option>
          <option class="menu" value="energyConsumptionLevel">Energy Consumption Level</option>
          <option class="menu" value="energySavingPlan">Energy Saving Plan</option>
          <option class="menu" value="recommendations">Recommendations</option>
          <option class="menu" value="report">Report</option>
          <option class="menu" value="about">About City</option>
        </select>
      </div>
    </header>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'stats' && !this.dataLoading">
      <div class="row">
        <div class="col-md-3 mb-1">
          <label for="months">Year:</label>
          <select id="months" class="form-control" v-model="year" @change="updateFilteredData">
            <option v-for="selectedYear in this.years" :key="selectedYear">{{ selectedYear }}</option>
          </select>
        </div>
        <div class="col-md-3 mb-1">
          <label for="months">Month:</label>
          <select id="months" class="form-control" v-model="month" @change="updateFilteredData">
            <option v-for="selectedMonth in this.months" :key="selectedMonth">{{ selectedMonth }}</option>
          </select>
        </div>
      </div>
      <div class="w-100">
        <div id="chart" class="border p-3">
          <table class="w-100">
            <tbody class="w-100">
            <tr v-for="(value) in filteredData" :key="value">
              <td class="w-50" style="border-bottom: 3px solid black; border-right: 3px solid black">{{
                  value[0]
                      .replace(/([a-z])([A-Z])/g, '$1 $2')
                      .replace(/^./, (str) => str.toUpperCase())
                }}
              </td>
              <td class="w-25" style="border-bottom: 3px solid black;">{{ value[1] }}</td>
              <td class="w-25" style="border-bottom: 3px solid black; border-right: 3px solid black">
                {{ measurements[value[0]] }}
              </td>
            </tr>
            </tbody>
          </table>
        </div>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energyBalanceCalculation' && !this.dataLoading">
      <div class="row">
        <h2 class="mb-4">Formulas List</h2>
        <ul class="list-group">
          <li v-for="(formula, index) in energy" :key="index" class="list-group-item">
            {{
              formula.name
                  .replace(/([a-z])([A-Z])/g, '$1 $2')
                  .replace(/^./, (str) => str.toUpperCase())
            }} = SUM({{
              formula.name
                  .replace(/([a-z])([A-Z])/g, '$1 $2')
                  .replace(/^./, (str) => str.toUpperCase())
            }}[i]) where i from {{ years[0] }} to {{ years[years.length - 1] }} = {{ formula.sum }}
            {{ measurements[formula.name] }}
          </li>
        </ul>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energyConsumptionLevel' && !this.dataLoading">
      <div class="row">
        <label v-for="(prop, index) in props" :key="index" class="w-25">
          <input type="checkbox" v-model="activeProps" :value="prop" @change="chart"/>
          {{
            prop
                .replace(/([a-z])([A-Z])/g, '$1 $2')
                .replace(/^./, (str) => str.toUpperCase())
          }}
        </label>
        <Apexchart class="w-100" :options="chartOptions" :series="chartSeries" type="line" height="600"/>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energySavingPlan' && !this.dataLoading">
      <div class="row">
        <pre class="text">
          Модель управління енергоресурсами міста – основна складова успішного реформування енергетичного забезпечення міста,
          що відповідає за всі напрями ефективного управління енергоресурсами.

          Система дистанційного енергетичного моніторингу (СДЕМ) створюється виходячи з таких передумов:
          1. Нормативних: невідповідність процесів нормативним актам у галузі енергозабезпечення та енергозбереження.
          2. Організаційних: невідповідність вимогам ефективності організації розподілу між суб'єктами сфер відповідальності за здійснення процесів.
          3. Технічних: невідповідність фактичних експлуатаційних характеристик обладнання вимогам надійності та ефективності,
             обліку та планування вимогам точності й несуперечності.
          4. Економічних: наявність невиправданих витрат у сфері енергозабезпечення.

          Передумови передбачають такі цілі створення СДЕМ:
          - підвищення надійності, безпеки та ефективності забезпечення енергетичними ресурсами населення, об'єктів міського господарства,
            промислових підприємств та інших споживачів;
          - підвищення ефективності управління ПЕР, скорочення витрат енергоресурсів та
            бюджету міста на забезпечення енергетичними ресурсами громадських установ міського підпорядкування;
          - формування та реалізація енергетичної політики міста,
            включаючи моніторинг виконання програм та проектів енергозбереження суб'єктами – учасниками програм з енергозбереження.

          Реалізація запланованих цілей забезпечує досягнення таких показників підвищення ефективності управління енергозабезпеченням
          та енергозбереженням за рахунок автоматизації
          - використання підсистеми управління проектами у сфері енергозбереження дозволить підвищити контроль за ходом їх реалізації та фінансування;
          - використання підсистеми обліку енергетичних ресурсів дозволить забезпечити вихідні дані для контролю показників фактичного виконання програм з енергозбереження;
          - використання підсистеми диспетчерського управління дозволить підвищити надійність та безаварійність енергопостачання;
          - використання підсистеми ведення нормативно-довідкової
            інформації дозволить здійснювати облік елементів міського енергогосподарства, необхідний для підтримки збору даних
            і розрахунку фактичних показників програм енергозбереження;
          - використання підсистеми моніторингу ефективності енергопостачання дозволить здійснювати контроль показників фактичного виконання програм енергозбереження.


          Процеси, що підлягають повній або частковій автоматизації за допомогою СДЕМ:

          1. Процеси в галузі забезпечення енергоресурсами:
          - моніторинг розподілу енергоносіїв (виробництво, розподіл, збут, споживання); - формування паливно-енергетичних балансів;
          - моніторинг технічного стану інфраструктури енергозабезпечення (номінальні характеристики, режими використання, навантаження);
          - моніторинг статусу використання інфраструктури (використовується, резерв, на ремонті, аварія тощо).

          2. Процеси в галузі енергозбереження:
          - планування та моніторинг виконання програм з енергозбереження;
          - планування та моніторинг досягнення цільових показників у області енергозбереження;
          - планування та моніторинг результативності заходів у сфері енергозбереження;
          - планування та моніторинг забезпечення оснащеності приладами обліку;
          - планування та моніторинг проведення енергетичних обстежень.

          3. Процеси управління в області енергозабезпечення та енергозбереження:
          - планування та контроль інвестицій у області енергозабезпечення та енергозбереження;
          - управління проектами.

          4. Забезпечення процесів в області енергозабезпечення та енергозбереження:
          - інформаційне забезпечення в галузі енергозбереження;
          - документальне забезпечення управління (інформаційної взаємодії) у рамках автоматизованих процесів.

          5. Процеси, підконтрольні відділу з питань енергоменеджменту та впровадження енергозберігаючих технологій виконкому міської ради:
          - планування та контроль діяльності відділу; - управління організаційно-розпорядчою документацією.
            Заходи зі створення, упровадження та експлуатації СДЕМ включають створення:
            - модуля оперативно-інформаційного комплексу диспетчерського управління об'єктами;
            - модуля автоматизованого управління технічним обслуговуванням і ремонтом на об'єктах енергозбереження;
            - модуля збору даних з приладів обліку тепла, води, газу;
            - модуля розрахунку балансів, втрат на об'єктах енергозбереження;
            - модуля планування енергоспоживання й тарифної політики;
            - модуля розрахунку фактичних значень показників проектів з енергозбереження та звірки з плановими значеннями;
            - модуля розробки програм з енергозбереження та оцінки ефективності їх виконання;
            - модуля автоматизованого моніторингу та аналізу енергосервісних послуг на об'єктах;
            - розподіленої апаратно-програмної інфраструктури резервування СДЕМ;
            - системи моніторингу функціонування, системного адміністрування та технічного обслуговування СДЕМ;
            - багаторівневої системи забезпечення інформаційної безпеки СДЕМ.
          </pre>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'recommendations' && !this.dataLoading">
      <div class="row">
        <pre class="text">

  Аналіз регуляторної та нормативно-правової бази в галузі енергозбереження, у тому числі зарубіжної, для підготовки пропозицій та пакетів документів щодо її вдосконалення.

  Розробка проектів і пакетів регуляторних документів та нормативно-правових актів міста Кривого Рогу, а саме:
  - проведення енерготехнологічних обстежень і енергетичної паспортизації об'єктів споживання, виробництва та розподілу енергоресурсів;
  - порядку складання та ведення паливно-енергетичних балансів і планів енергетичного розвитку міста Кривого Рогу;
  - створення системи управління ПДСЕР, включаючи створення системи моніторингу та контролю за реалізацією заходів з енергозбереження;
  - порядок обліку і перерозподілу вивільненої в процесі реалізації енергозберігаючих заходів приєднаної потужності;
  - удосконалення нормативно-правової бази енергозбереження при виробництві, передачі та споживанні енергоресурсів;
  - упровадження та розвитку практики енергосервісних контрактів у бюджетній сфері та розвитку державно-приватного партнерства;
  - упровадження та розвиток правових і фінансових механізмів, що передбачають можливість компенсації інвесторам та іншим особам за скорочення викидів оксиду вуглецю в рамках Кіотського протоколу та одержаної економії в рамках енергосервісного контракту

  Очікувані результати: створення необхідних правових умов для розвитку енергозбереження та залучення до процесу енергозбереження всіх груп споживачів

  Перелік рекомендованих енергоефективних заходів:
  ˗ утеплення зовнішніх стін мінеральною ватою товщиною 100 - 120 мм;
  ˗ утеплення даху мінеральною ватою (150 мм);
  ˗ заміна дерев’яних вікон на склопакети класу А (Umin=1,33 Вт/(м2 ∙К); ˗ заміна або утеплення вхідних дверей;
  ˗ балансування внутрішніх систем опалення або їх повна реконструкція; ˗ установлення автоматизованих індивідуальних теплових пунктів;
  ˗ ізоляція трубопроводів внутрішніх мереж теплопостачання, що розміщені в неопалювальних приміщеннях.

  Програмні заходи також можна реалізовані за такими напрямами:
    1. Організація пропаганди енергозбереження для ефективного впливу на споживачів енергоресурсів за принципом інформаційної хвилі. При цьому вирішуються два завдання: мотивація до економії й пропозиція конкретних дій для її досягнення.
    2. Активне формування енергоощадливої свідомості населення й престижу економного ставлення до енергоресурсів у суспільстві.
    3. Надання в простих і доступних формах інформації про способи енергозбереження в побуті, переваги енергозберігаючих технологій та обладнання, особливості їх вибору й експлуатації.
    4. Залучення до процесу енергозбереження всіх соціальних верств населення міста, громадських організацій, енергосервісних компаній, організацій співвласників багатоквартирних будинків (надалі - ОСББ) та житловобудівельних кооперативів (надалі - ЖБК), які в першу чергу мають потребу в інформації про можливі технічні та організаційні рішення для енергозбереження в житлових будинках, про ПДСЕР та його можливості.
    5. Проведення занять з основ енергозбереження серед учнів навчальних закладів міста, що дозволять сформувати світогляд про дбайливе використання енергії.
    6. Залучення молоді до процесу енергозбереження при проведенні молодіжних фестивалів, де здійснюється охоплення широкої аудиторії із залученням ЗМІ, що дозволить звернути увагу молоді на проблему ресурсозбереження.
    7. Щорічне проведення Тижня енергоефективності, Днів енергії.
    8. Надання інформації організаціям і підприємствам про енергозберігаючі прийоми й методи господарювання.
    9. Популяризація використання електро- та велотранспорту.
    10. Довгострокове партнерство з мережами торгівлі, закладів громадського харчування, продуктових магазинів тощо.
    11. Друк флаєрів, запрошень, розклеювання плакатів, розповсюдження банерів, пропаганда програми на чеках (друк спеціальної касової стрічки). Насамперед всі вищезазначені напрями мають на меті формування стабільного економічного та політичного клімату, дружніх відносин між суб’єктами підприємницької діяльності, споживачем та органами місцевої влади.

  Інформаційна підтримка заходів може здійснюватися з широким залученням позабюджетних джерел фінансування. Забезпечення виконання заходів передбачається реалізувати через:
  - пріоритетність вимог ефективного використання природних та енергетичних ресурсів під час провадження господарської, управлінської або іншої діяльності, пов’язаної з використанням паливно-енергетичних ресурсів;
  - здійснення державного управління у сфері ефективного використання паливно-енергетичних ресурсів з урахуванням засад державно-приватного партнерства;
  - популяризацію економічних, екологічних та соціальних переваг ефективного використання паливно-енергетичних ресурсів, підвищення рівня громадської свідомості в питаннях їх ефективного використання.
Рекомендації

Аналіз регуляторної та нормативно-правової бази в галузі енергозбереження, у тому числі зарубіжної, для підготовки пропозицій та пакетів документів щодо її вдосконалення.

Розробка проектів і пакетів регуляторних документів та нормативно-правових актів міста Кривого Рогу, а саме:
- проведення енерготехнологічних обстежень і енергетичної паспортизації об'єктів споживання, виробництва та розподілу енергоресурсів;
- порядку складання та ведення паливно-енергетичних балансів і планів енергетичного розвитку міста Кривого Рогу;
- створення системи управління ПДСЕР, включаючи створення системи моніторингу та контролю за реалізацією заходів з енергозбереження;
- порядок обліку і перерозподілу вивільненої в процесі реалізації енергозберігаючих заходів приєднаної потужності;
- удосконалення нормативно-правової бази енергозбереження при виробництві, передачі та споживанні енергоресурсів;
- упровадження та розвитку практики енергосервісних контрактів у бюджетній сфері та розвитку державно-приватного партнерства;
- упровадження та розвиток правових і фінансових механізмів, що передбачають можливість компенсації інвесторам та іншим особам за скорочення викидів оксиду вуглецю в рамках Кіотського протоколу та одержаної економії в рамках енергосервісного контракту.

Очікувані результати: створення необхідних правових умов для розвитку енергозбереження та залучення до процесу енергозбереження всіх груп споживачів.

	Наприклад кам'яне вугілля в місті споживається переважно в промисловому секторі.
У незначних обсягах вугілля споживається в приватному секторі, але статистика щодо його споживання в цьому секторі відсутня. У загальній структурі споживання твердого та рідкого палива – вугілля складає 87,6%.
	Споживання кам'яного вугілля та рідкого палива за період 2009 – 2014 років (тис. МВт∙год)

<img v-bind:src="images[4]" class="img-thumbnail"/>

	Загальний річний обсяг споживання природного газу в місті становить 1880 млн. м3. Серед споживачів природного газу можна виділити основні сектори:
	˗ промислові підприємства (61,2%), що споживають природний газ для забезпечення виробничих процесів, пов'язаних з життєдіяльністю певної
галузі;
	˗ теплопостачальні підприємства (25,3%) – споживають природний газ на потреби виробництва теплової енергії;
	˗ населення (2,7%), яке споживає природний газ для забезпечення  побутових потреб, індивідуальних систем опалення та гарячого водопостачання.

	Споживання природного газу за період 2009– 2016 років (тис. МВт∙год.)

<img v-bind:src="images[2]" class="img-thumbnail"/>

	Загальний річний обсяг споживання електричної енергії в місті становить
12 048 тис. МВт∙год. Загальне споживання електроенергії секторами, на які місто має вплив, складає 1,2% від загального споживання в місті.
	Структура споживачів електричної енергії в 2010 році (тис. МВт∙год)

<img v-bind:src="images[3]" class="img-thumbnail"/>


Перелік рекомендованих енергоефективних заходів:
˗ утеплення зовнішніх стін мінеральною ватою товщиною 100 - 120 мм;
˗ утеплення даху мінеральною ватою (150 мм);
˗ заміна дерев’яних вікон на склопакети класу А (Umin=1,33 Вт/(м2 ∙К); ˗ заміна або утеплення вхідних дверей;
˗ балансування внутрішніх систем опалення або їх повна реконструкція; ˗ установлення автоматизованих індивідуальних теплових пунктів;
˗ ізоляція трубопроводів внутрішніх мереж теплопостачання, що розміщені в неопалювальних приміщеннях.

Обсяги виробництва теплової енергії на потреби споживачів (тис. МВт∙год)

<img v-bind:src="images[6]" class="img-thumbnail"/>

	Так як місто має одну з найскладніших в Україні систем водопостачання та водовідведення. На її роботу значний вплив мають такі фактори як велика довжина міста, відсутність рельєфу, необхідного для облаштування самопливної каналізації, діяльність гірничо-металургійного комплексу, специфіка геології.

	Як результат, збір і перекачування стічних вод на очисні споруди міста здійснюються з використанням великої кількості насосних станцій. При цьому, кількість етапів перекачування стічних вод досягає п'яти ступенів. Тому 62% від загального обсягу електроенергії, що витрачається підприємством на водовідведення, – це витрати електроенергії на перекачування стічних вод.

Споживання води за період 2009– 2016 років (млн. м3 )

<img v-bind:src="images[6]" class="img-thumbnail"/>

	Відповідно до малюнку споживання води за період 2009– 2014 років перебуває на однаковому рівні. У 2015 – 2016 роках спостерігається скорочення обсягів спожитої води від 29 до 49% у порівнянні з 2010 роком.

Програмні заходи також можна реалізовані за такими напрямами:
	1. Організація пропаганди енергозбереження для ефективного впливу на споживачів енергоресурсів за принципом інформаційної хвилі. При цьому вирішуються два завдання: мотивація до економії й пропозиція конкретних дій для її досягнення.
	2. Активне формування енергоощадливої свідомості населення й престижу економного ставлення до енергоресурсів у суспільстві.
	3. Надання в простих і доступних формах інформації про способи енергозбереження в побуті, переваги енергозберігаючих технологій та обладнання, особливості їх вибору й експлуатації.
	4. Залучення до процесу енергозбереження всіх соціальних верств населення міста, громадських організацій, енергосервісних компаній, організацій співвласників багатоквартирних будинків (надалі - ОСББ) та житловобудівельних кооперативів (надалі - ЖБК), які в першу чергу мають потребу в інформації про можливі технічні та організаційні рішення для енергозбереження в житлових будинках, про ПДСЕР та його можливості.
	5. Проведення занять з основ енергозбереження серед учнів навчальних закладів міста, що дозволять сформувати світогляд про дбайливе використання енергії.
	6. Залучення молоді до процесу енергозбереження при проведенні молодіжних фестивалів, де здійснюється охоплення широкої аудиторії із залученням ЗМІ, що дозволить звернути увагу молоді на проблему ресурсозбереження.
	7. Щорічне проведення Тижня енергоефективності, Днів енергії.
	8. Надання інформації організаціям і підприємствам про енергозберігаючі прийоми й методи господарювання.
	9. Популяризація використання електро- та велотранспорту.
	10. Довгострокове партнерство з мережами торгівлі, закладів громадського харчування, продуктових магазинів тощо.
	11. Друк флаєрів, запрошень, розклеювання плакатів, розповсюдження банерів, пропаганда програми на чеках (друк спеціальної касової стрічки). Насамперед всі вищезазначені напрями мають на меті формування стабільного економічного та політичного клімату, дружніх відносин між суб’єктами підприємницької діяльності, споживачем та органами місцевої влади.

Структура власних та закріплених доходів міського бюджету за 2016 рік, млн. грн.

<img v-bind:src="images[0]" class="img-thumbnail"/>

	Інформаційна підтримка заходів може здійснюватися з широким залученням позабюджетних джерел фінансування. Забезпечення виконання заходів передбачається реалізувати через:
- пріоритетність вимог ефективного використання природних та енергетичних ресурсів під час провадження господарської, управлінської або іншої діяльності, пов’язаної з використанням паливно-енергетичних ресурсів;
- здійснення державного управління у сфері ефективного використання паливно-енергетичних ресурсів з урахуванням засад державно-приватного партнерства;
- популяризацію економічних, екологічних та соціальних переваг ефективного використання паливно-енергетичних ресурсів, підвищення рівня громадської свідомості в питаннях їх ефективного використання.

      </pre>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'report' && !this.dataLoading">
      <div class="row">
        <pre class="text">
          Наявність сучасного управління системою енергетичного менеджменту на муніципальному рівні забезпечує
          дієвий контроль за споживанням енергетичних ресурсів на міському рівні. У першу чергу це
          стосується управління бюджетними установами, де є необхідність у запровадженні автоматизованого обліку та
          аналізу споживання енергоресурсів, виконанні енергоаудитів та розробки енергоефективних заходів, управлінні
          виконанням проектних робіт та влаштуванні енергозберігаючого обладнання, плануванні нових норм споживання енергоресурсів.

          Автоматизований енергомоніторинг у бюджетних установах є вкрай необхідним для забезпечення якісного та
          оперативного контролю за рівнем енергоефективності будівель та верифікації отриманої економії в результаті впровадження енергоефективних заходів.

          Тому наявність енергетичного менеджменту є одним із ключових завдань.
          За результатами проведеного аналізу ефективності роботи енергетичного менеджменту виявлено, що
          система має недоліки. Наявна система енергетичного менеджменту (надалі – СЕМ) у багатьох випадках залежить від людського фактору; відсутнє матеріальне стимулювання задіяних у енергетичному менеджменті працівників бюджетної сфери тощо.

          Для вдосконалення функціонування СЕМ пропонується скористатися досвідом міст, що мають розвинену
          систему управління споживанням енергії, набутим у пілотних містах України в процесі реалізації
          демонстраційних проектів зі створення комп’ютеризованої системи управління енерговикористанням
          для бюджетної сфери.При цьому трирівнева модель системи енергоменеджменту ("установа – галузевий підрозділ – виконком") вибудовується
          як додатковий компонент існуючої трирівневої галузевої схеми управління бюджетними установами (освіта, охорона здоров'я, культура та ін.).
          Пропоновані інновації в системі управління мають забезпечити цілісність процесів управління споживанням енергоресурсів i органічно поєднати їх з традиційними видами управлінської діяльності, такими як: управління фінансами, кадрами тощо.

          Функціонування удосконаленої СЕМ передбачається на базі існуючого відділу з питань енергоменеджменту та впровадження енергозберігаючих технологій виконкому міської ради. Його метою є сприяння сталому енергетичному розвитку міста, здійснення системного підходу до підвищення енергоефективності інфраструктури міста шляхом:
            - керування енергоспоживанням об’єктів інфраструктури міста;
            - розробки та сприяння реалізації міських інвестиційних проектів та програм підвищення енергоефективності;
            - забезпечення довгострокової реалізації стратегії сталого розвитку в сфері енергоспоживання та енергоефективності міста;
            - підвищення інвестиційної привабливості міста, створення та просування інвестиційних продуктів.
          У Кривому Розі вже розпочата та триває робота з упровадження диспетчеризації в бюджетних закладах міста:
            - у 2014, 2015 роках впроваджено пілотний проект з удосконалення системи моніторингу шляхом оснащення лічильників обладнанням з
          автоматизованого збору та аналізу даних споживання теплової й електричної енергії, води;
            - у 2016 році таким обладнанням оснащено лічильники (до яких ускладнено доступ) у окремих закладах охорони здоров'я міста.
          Для забезпечення ефективного енергомоніторингу та верефікації впровадження проектів з енергозбереження в бюджетних
          будівлях заплановано продовження реалізації впровадження автоматизованої системи моніторингу споживання енергетичних ресурсів з елементами диспетчеризації в
          бюджетних закладах міста.

          За результатами проведеного аналізу споживання первинних
          енергетичних ресурсів у м. Кривому Розі виявлено, що загальне річне
          споживання становить 57,6 млн. МВт∙год., або 4,8 млрд. грн. у цінах на ПЕР
          2010 року.
          Основні види ПЕР, які мають значний вплив на функціонування міста:
          вугілля (42,4%), природний газ (30,7%), електрична енергія (20,9%). Інші
          енергетичні ресурси в загальній структурі енергоспоживання займають 6,0%.
          Обсяги та тенденція зміни споживання первинних паливно-енергетичних
          ресурсів за період 2009– 2014 роках наведено на малюнку.
          Структура спожитих ПЕР містом в 2010 році (тис. МВт∙год):

          <img v-bind:src="images[0]" class="img-thumbnail" alt="Thumbnail Image">

          Для можливості складання паливно-енергетичного балансу та виконання
          порівняльних аналізів енергетичні ресурси приведені до єдиної енергетичної
          одиниці вимірювання – МВт∙год.

          Споживання палива на території м. Кривого Рогу, тис. МВт∙год.

          <img v-bind:src="images[1]" class="img-thumbnail" alt="Thumbnail Image">

          У 2009–2011 роках спостерігається поступове зростання енергоспоживання, пов'язане з відновленням економічної стабільності в країні, після економічної кризи в 2008 році. Поступове зменшення споживання ПЕР, що відбувалось у період з 2012 до 2014 років, пояснюється декількома факторами: упровадженням новітніх енергоефективних технологій у промисловому секторі; скороченням обсягів виробництва в промисловому секторі в 2014 році, нестабільною ситуацією в країні; упровадженням жорстких адміністративних заходів зі скорочення споживання ПЕР у всіх секторах, що пов'язано зі скрутним становищем у паливно-енергетичному комплексі країни в 2014 році; відсутністю достовірної інформації щодо споживання пального.

          Загальний річний обсяг споживання природного газу в місті становить 1880 млн. м3. Серед споживачів природного газу можна виділити основні сектори:
          ˗ промислові підприємства (61,2%), що споживають природний газ для забезпечення виробничих процесів, пов'язаних з життєдіяльністю певної
          галузі;
          ˗ теплопостачальні підприємства (25,3%) – споживають природний газ на потреби виробництва теплової енергії;
          ˗ населення (2,7%), яке споживає природний газ для забезпечення  побутових потреб, індивідуальних систем опалення та гарячого водопостачання.

          Споживання природного газу за період 2009– 2016 років (тис. МВт∙год.)

          <img v-bind:src="images[2]" class="img-thumbnail" alt="Thumbnail Image">

          Істотних змін у споживанні природного газу населенням та бюджетом не спостерігається. Коливання в споживанні природного газу теплопостачальними
          Продовження додатка підприємствами спричинені різною кількістю діб опалювального сезону та середньою температурою зовнішнього повітря в опалювальний сезон. Лише з 2014 року відбулося значне скорочення споживання природного газу, що пояснюється скороченням обсягів виробництва в промисловому секторі, нестабільною ситуацією в країні та впровадженням жорстких адміністративних заходів зі скорочення споживання ПЕР у всіх секторах, скрутним становищем у паливно-енергетичному комплексі країни.

          Аналіз споживання електричної енергії

          Загальний річний обсяг споживання електричної енергії в місті становить
          12 048 тис. МВт∙год. Загальне споживання електроенергії секторами, на які місто має вплив, складає 1,2% від загального споживання в місті.
          Структура споживачів електричної енергії в 2010 році (тис. МВт∙год)

          <img v-bind:src="images[3]" class="img-thumbnail" alt="Thumbnail Image">

          Аналіз споживання кам'яного вугілля та інших видів палива

          Кам'яне вугілля в місті споживається переважно в промисловому секторі.
          У незначних обсягах вугілля споживається в приватному секторі, але статистика щодо його споживання в цьому секторі відсутня. У загальній структурі споживання твердого та рідкого палива – вугілля складає 87,6%.
          Споживання кам'яного вугілля та рідкого палива за період 2009 – 2014 років (тис. МВт∙год)

          <img v-bind:src="images[4]" class="img-thumbnail" alt="Thumbnail Image">

          Аналіз споживання води

	Водопостачання Кривого Рогу здійснюється з двох основних джерел: Карачунівського та Південного водосховищ, що наповнюються каналом Дніпро-Кривий Ріг шляхом перекачування води з Каховського водосховища.

	Система водопостачання міста – централізована, загальною продуктивністю 950 000 м3/добу. Водозабезпечення здійснюють два підприємства:
	- державне промислове підприємство "Кривбаспромводопостачання", що забезпечує виробництво питної та технічної води;
	- КП "Кривбасводоканал", основна діяльність якого – транспортування
питної та технічної води за допомогою комплексу об’єктів, споруд, розподільчих водопровідних мереж, пов’язаних єдиним технологічним процесом, тобто надає послуги з водопостачання та водовідведення для населення, організацій і підприємств міста.

	КП "Кривбасводоканал" обслуговує 284 198 абонентів, з них: населення – 284 064 абоненти, які споживають 30,8% води; бюджетні установи – 261 абонентів, споживають 1,9%; промисловість та інші споживачі – 4 873 абоненти
(10,6%). Решта 56,8% питної води розподіляється на власні потреби підприємства та втрати в зовнішніх мережах водопостачання.

	Для забезпечення безперебійної роботи системи водопостачання та водовідведення в складі підприємства функціонують: 9 районних служб водопостачання та водовідведення, три диспетчерські служби – Центральна, Північна, Інгулецька, хіміко-бактеріологічна лабораторія, енергослужба, автотранспортний цех, ремонтно-механічна майстерня, ремонтно-будівельний цех, відділ "Водозбут".

	Основне завдання КП "Кривбасводоканал" – забезпечення населення й
підприємств міста водою, що відповідає за якістю ДСТУ, водовідведення та
очищення каналізаційних стоків. Водопостачання й прийом стоків води в місті
здійснюється цілодобово.
	Місто має одну з найскладніших в Україні систем водопостачання та водовідведення. На її роботу значний вплив мають такі фактори як велика довжина міста, відсутність рельєфу, необхідного для облаштування самопливної каналізації, діяльність гірничо-металургійного комплексу, специфіка геології.

	Як результат, збір і перекачування стічних вод на очисні споруди міста здійснюються з використанням великої кількості насосних станцій. При цьому, кількість етапів перекачування стічних вод досягає п'яти ступенів. Тому 62% від загального обсягу електроенергії, що витрачається підприємством на водовідведення, – це витрати електроенергії на перекачування стічних вод.

Споживання води за період 2009– 2016 років (млн. м3 )

          <img v-bind:src="images[5]" class="img-thumbnail" alt="Thumbnail Image">

          Відповідно до малюнку споживання води за період 2009– 2014 років перебуває на однаковому рівні. У 2015 – 2016 роках спостерігається скорочення обсягів спожитої води від 29 до 49% у порівнянні з 2010 роком.


Аналіз споживання вторинних паливно-енергетичних ресурсів
Виробництво теплової енергії

	До вторинних паливно-енергетичних ресурсів належить теплова енергія (надалі – ТЕ), для виробництва якої теплопостачаючі підприємства використовують природний газ.
	У структуру системи теплопостачання міста входять 7 теплових районів: Інгулецький, Центрально-Міський, Металургійний, Довгинцівський, Саксаганський, Покровський, Тернівський.

Розподіл приєднаного розрахункового теплового навантаження

          <img v-bind:src="images[6]" class="img-thumbnail" alt="Thumbnail Image">

          Централізованим теплопостачанням охоплено житловий фонд міста (4985 житлових будинків), інша його частина (у більшості це приватний сектор) опалюється від індивідуальних джерел теплопостачання.
	Надання послуг з централізованого теплопостачання забезпечують 3 підприємства різної форми власності та відомчі котельні. До найбільш потужних теплопостачальних підприємств, що обслуговують 97,6% споживачів ЦСТ можна віднести комунальне підприємство теплових мереж (надалі – КПТМ "Криворіжтепломережа") та публічне акціонерне товариство "Криворізька теплоцентраль" (надалі – ПАТ "Криворізька теплоцентраль").
	Обсяг виробництва теплової енергії розподіляється між КПТМ "Криворіжтепломережа" та ПАТ "Криворізька теплоцентраль" майже рівномірно: 49,5% та 50,5%, відповідно.
	Серед споживачів ТЕ, підключених до централізованої системи теплопостачання, основними секторами є: населення – 80,4% та бюджетні організації (11,7%) – будівлі державного/обласного (4,7%) та міського (7,0%) підпорядкування. Загальний обсяг теплової енергії, спожитий в 2010 році становить 4 620,3 тис. МВт∙год

Структура споживання ТЕ споживачами, підключеними до ЦСТ (тис. МВт∙год)

          <img v-bind:src="images[7]" class="img-thumbnail" alt="Thumbnail Image">

          Обсяги виробництва та споживання теплової енергії прямо залежать від температури зовнішнього повітря та кількості діб опалювального сезону. Для виконання аналізу та виявлення сформованих тенденцій споживання ПЕР і обсягу виробництва ТЕ фактичні показники роботи теплопостачальних підприємств скориговані у відповідності до градусо-діб опалювального періоду (надалі – ГДОП) базового 2010 року.
	Споживання ТЕ за 2009 – 2014 роки приведене до ГДОП базового року та зображене на малюнку нижче.
	Загальні показники опалювального періоду базового року враховують такі значення:
	- тривалість опалювального сезону – 181 доба;
	- середня температура зовнішнього повітря в опалювальний сезон – +1,150С.
	Рівень споживання ТЕ приведений до нормативних показників температури внутрішнього повітря в приміщеннях споживачів.

Обсяги виробництва теплової енергії на потреби споживачів (тис. МВт∙год)

          <img v-bind:src="images[8]" class="img-thumbnail" alt="Thumbnail Image">

          Рівень споживання ТЕ протягом розглянутого періоду має незначні коливання. У період 2009– 2011 років спостерігається зменшення споживання в середньому на 5% на рік. У наступний період з 2012 до 2013 років відбувається поступове зростання споживання. З 2014 року відбулося значне скорочення споживання, що пояснюється нестабільною ситуацією в країні, скрутним становищем у паливно-енергетичному комплексі країни. Найбільше коливання в споживанні теплової енергії спостерігаються в секторі населення.

Аналіз фінансових можливостей міського бюджету

Міський бюджет Кривого Рогу у 2016 році виконано на 103,6% у сумі 5 076,4 млн. грн., зважаючи на складну економічну ситуацію. Це на 15% більше ніж у 2015 році. Офіційні трансферти (кошти, що надійшли з інших бюджетів) склали 2 265,4 млн. грн.

Структура власних та закріплених доходів міського бюджету за 2016 рік, млн. грн.

          <img v-bind:src="images[9]" class="img-thumbnail" alt="Thumbnail Image">

          Аналіз міського бюджету показує його залежність від міжбюджетних трансфертів, їх доля в міському бюджеті складала від 33% у 2010 році до 45% у 2016 році
        </pre>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'about' && !this.dataLoading">
      <div class="row">
        <pre class="text">
          Кривий Ріг — місто в Україні, у Дніпропетровській області, адміністративний центр Криворізького району та Криворізької міської громади. Сьоме за населенням та друге за площею місто України. Є найдовшим містом Європи: лінійна довжина міста (відстань між крайніми південною та північною точками на межі міста) становить 66,1 км. Розташований на березі річок Інгулець і Саксагань.

<img v-bind:src="images[10]" class="img-thumbnail"/>



	Місто знаходиться у зоні, котра характеризується вологим континентальним кліматом зі спекотним літом. Найтепліший місяць — липень із середньою температурою 27,8 °C (82.04 °F). Найхолодніший місяць — січень, із середньою температурою -6,3 °С (20.66 °F). Більша частина опадів випадає під час теплої половини року (квітень-жовтень) — 268 мм.

	Станом на 01.12.2016 кількість населення складає 639876 осіб. Густота населення – 1 488 осіб/км². Динаміка зміни кількості населення м. Кривого Рогу
за 2008– 2017 роки (тис. осіб):

<img v-bind:src="images[11]" class="img-thumbnail"/>


	Територія міста поділена на 7 районів: Інгулецький, Центрально-Міський,
Металургійний, Довгинцівський, Саксаганський, Покровський та Тернівський.
За адміністративно-територіальним устроєм до його складу входять 3 селища та
2 села. Статистичний аналіз вказує на те, що населення Кривого Рогу поступово
скорочується. Зменшення кількості населення пояснюється як природними, так
і міграційними чинниками. Протягом останніх років смертність була вищою
ніж народжуваність.

	Кривий Ріг – центр багатогалузевого промислового вузла, у якому налічується близько 6 000 підприємств. Промисловий комплекс міста складається з 73 великих та середніх підприємств різних галузей: чорної металургії, машинобудівної, будматеріалів, хімічної, поліграфічної, деревообробної, легкої, харчової промисловості тощо. У Криворізькому басейні розташовано вісім з одинадцяти підприємств України з видобутку та переробки залізорудної сировини, а також підприємства з обслуговування основного виробництва.
	Економічний потенціал міста представляють понад 12,6 тис. суб’єктів підприємницької діяльності – юридичних осіб та майже 78,5 тис. підприємців –
фізичних осіб. Головною містоутворюючою галуззю, що визначає профіль міста, є чорна металургія.

	Постачання газу здійснює ВАТ «Криворіжгаз», активна газифікація почалася 1957 року. Послуги водопостачання та водовідведення забезпечує «Кривбасводоканал». Джерелом водопостачання є річка Інгулець та міські водосховища, водогін почав працювати у 1928 році. Постачання електроенергії містянам здійснює Криворізька ТЕС (ВАТ «ДТЕК Дніпроенерго»).
	Експлуатацію багатоквартирних житлових будинків та прибудинкових територій здійснює 45 комунальних підприємств («ЖЕКи»). Разом з цим, розповсюджені Об'єднання співвласників багатоквартирних будинків. Інші підприємства — «Кривбасстандартметрологія», «Криворіжтепломережа» (у місті 72 котельні та 383,8 км теплових мереж), ДП «Криворізька теплоцентраль», «Екоспецтранс», «Міськліфт», у місті запроваджена єдина автоматизована міська система комунальних розрахунків «НОВА-КОМ». У Кривому Розі розташовано 68 поштових відділень.
	Криворізька ТЕС — найбільша електростанція області. Одна з найбільших теплових електростанцій України. Криворізька ТЕС розташована за 20 км на захід від міста Апостолове і за 2 км від Зеленодольська. Станція забезпечує електроенергією свій регіон.
	Технічні характеристики: Проєктна потужність — 2400 МВт. Енергетичне устаткування станції: 10 блоків по 282 МВт, із котлами П-50 — 4 блоки, із котлами ТАП-210А — 6 блоків, турбінами: К-300-240-2, К-300-240.
	Із введенням енергоблока № 8 Криворізька ТЕС досягла проєктної потужності 2400 МВт і стала першою блоковою тепловою електростанцією на твердому паливі, побудованою за типовим проєктом з енергоблоками 300 МВт. Саме Криворізька ТЕС стала полігоном для випробування і впровадження типових схем освоєння й експлуатації устаткування, ведення режимів експлуатації.
	Проєктне паливо — рядове вугілля, резервне — мазут і газ. Електрична енергія подається з напругою 150 і 330 кВ із відкритих розподільних пристроїв.


        </pre>
      </div>
    </main>
  </div>
</template>

<script>
import VueApexCharts from 'vue-apexcharts';

const structureImage = require('@/resources/structure.png')
const fuelImage = require('@/resources/fuel.png')
const gasImage = require('@/resources/gas.png')
const diagramImage = require('@/resources/diagram.png')
const coalImage = require('@/resources/coal.png')
const aquaImage = require('@/resources/aqua.png')
const heatImage = require('@/resources/heat.png')
const energyImage = require('@/resources/energy.png')
const consumerImage = require('@/resources/consumer.png')
const compressImage = require('@/resources/compress.png')
const apmImage = require('@/resources/apm.png')
const jabriceImage = require('@/resources/jabrice.png')

export default {
  name: "App",
  data() {
    return {
      dataLoading: true,
      data: null,
      year: null,
      month: null,
      years: [],
      months: [],
      filteredData: null,
      mode: 'about',
      measurements: [],
      props: [],
      activeProps: [],
      chartOptions: {
        chart: {
          id: 'line-chart',
        },
        xaxis: {
          categories: [],
        },
      },
      chartSeries: [],
      energy: [],
      images: [structureImage, fuelImage, gasImage, diagramImage, coalImage, aquaImage, heatImage, energyImage, consumerImage, compressImage, apmImage, jabriceImage]
    };
  },
  components: {
    Apexchart: VueApexCharts,
  },
  watch: {
    mode(old, edit) {
      if (edit === 'energyConsumptionLevel') {
        this.chart()
      }
    }
  },
  async beforeCreate() {
    await fetch("http://localhost:8080/api/v1/manager/data")
        .then(response => response.json())
        .then(data => {
          this.data = data;
          this.filteredData = this.data;
          this.years = Object.keys(this.data).slice().sort()
          this.months = Object.keys(this.data[this.years[0]][Object.keys(this.data[this.years[0]])[0]]).slice().sort();
          this.year = this.years[0]
          this.month = this.months[0]
          this.updateFilteredData()
          this.props = Object.keys(this.data[this.year])
        })
        .catch(error => {
          console.error("Error fetching data:", error);
        });

    await fetch("http://localhost:8080/api/v1/manager/measurement")
        .then(response => response.json())
        .then(data => {
          this.measurements = data;
          this.dataLoading = false;
        })
        .catch(error => {
          console.error("Error fetching data:", error);
          this.dataLoading = false;
        });

    this.chartOptions.xaxis.categories = Object.keys(this.data).slice().sort()
    this.calculateEnergy();
  },
  methods: {
    updateFilteredData() {
      this.filteredData = this.data[this.year];
      let map = new Map();

      for (const entry in this.filteredData) {
        const monthValue = this.filteredData[entry][this.month];
        map.set(entry, monthValue);
        console.log(monthValue);
      }

      this.filteredData = map;
      console.log(this.filteredData);
    },
    chart() {
      this.chartSeries = []

      Object.keys(this.data).forEach(key => {
        let props = this.data[key];

        Object.keys(props).forEach(property => {
          if (this.activeProps.includes(property)) {
            let values = Object.values(props[property]);
            let approx = this.calculateAverage(values)
            let series = this.chartSeries.find(series => series.name === property.replace(/([a-z])([A-Z])/g, '$1 $2')
                .replace(/^./, (str) => str.toUpperCase()));

            if (series) {
              series.data.push(approx);
            } else {
              series = {
                name: property.replace(/([a-z])([A-Z])/g, '$1 $2')
                    .replace(/^./, (str) => str.toUpperCase()),
                data: [approx]
              };

              this.chartSeries.push(series);
            }
          }
        });
      });
    },
    calculateAverage(arr) {
      if (arr.length === 0) {
        return 0;
      }
      const sum = arr.reduce((acc, value) => acc + value, 0);
      return sum / arr.length;
    },
    calculateEnergy() {
      Object.keys(this.data).forEach(key => {
        let props = this.data[key];

        Object.keys(props).forEach(property => {
          if (property.includes('Consumption')) {
            let values = Object.values(props[property]);
            let sum = values.reduce((acc, value) => acc + value, 0);

            let energyEntry = this.energy.find(entry => entry.name === property);
            if (energyEntry) {
              energyEntry.sum += sum;
            } else {
              energyEntry = {
                name: property,
                sum: sum
              };

              this.energy.push(energyEntry);
            }
          }
        });
      });
    }
  }
};
</script>

<style>

@import url('https://fonts.googleapis.com/css2?family=Roboto+Condensed:ital@1&display=swap');

::-webkit-scrollbar {
  display: none;
}

#app {
  font-family: 'Roboto Condensed', sans-serif;
  font-size: 1.5rem;
}

.menu {
  font-size: 1.5rem;
}

.text {
  font-size: 1.3rem;
  font-style: italic;
  text-space: 3px;
  letter-spacing: 1px;
  word-wrap: break-word;
  white-space: pre-wrap;
  overflow-wrap: break-word;
  max-width: 100%;
}
</style>
