<template xmlns:v-key="http://www.w3.org/1999/xhtml">
  <div id="app">
    <header class="container-fluid">
      <div class="row mb-3">
        <select id="actions" class="form-control" data-style="btn-primary" data-size="5" v-model="mode">
          <option class="menu" value="stats">Stats</option>
          <option class="menu" value="energyBalanceCalculation">Energy Balance Calculation</option>
          <option class="menu" value="energyConsumptionLevel">Energy Consumption Level</option>
          <option class="menu" value="energySavingPlan">Energy Saving Plan</option>
          <option class="menu" value="recommendations">Recommendations</option>
          <option class="menu" value="report">Report</option>
        </select>
      </div>
    </header>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'stats' && !this.dataLoading">
      <div class="row">
        <div class="col-md-3 mb-1">
          <label for="months">Year:</label>
          <select id="months" class="form-control" v-model="year" @change="updateFilteredData">
            <option v-for="selectedYear in this.years" :key="selectedYear">{{ selectedYear }}</option>
          </select>
        </div>
        <div class="col-md-3 mb-1">
          <label for="months">Month:</label>
          <select id="months" class="form-control" v-model="month" @change="updateFilteredData">
            <option v-for="selectedMonth in this.months" :key="selectedMonth">{{ selectedMonth }}</option>
          </select>
        </div>
      </div>
      <div class="w-100">
        <div id="chart" class="border p-3">
          <table class="w-100">
            <tbody class="w-100">
            <tr v-for="(value) in filteredData" :key="value">
              <td class="w-50" style="border-bottom: 3px solid black; border-right: 3px solid black">{{ value[0]
                  .replace(/([a-z])([A-Z])/g, '$1 $2')
                  .replace(/^./, (str) => str.toUpperCase()) }}
              </td>
              <td class="w-25" style="border-bottom: 3px solid black;">{{ value[1] }}</td>
              <td class="w-25" style="border-bottom: 3px solid black; border-right: 3px solid black">{{ measurements[value[0]] }}</td>
            </tr>
            </tbody>
          </table>
        </div>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energyBalanceCalculation' && !this.dataLoading">
      <div class="row">
        <h2 class="mb-4">Formulas List</h2>
        <ul class="list-group">
          <li v-for="(formula, index) in energy" :key="index" class="list-group-item">
            {{ formula.name
            .replace(/([a-z])([A-Z])/g, '$1 $2')
            .replace(/^./, (str) => str.toUpperCase()) }} = SUM({{ formula.name
            .replace(/([a-z])([A-Z])/g, '$1 $2')
            .replace(/^./, (str) => str.toUpperCase()) }}[i]) where i from {{ years[0] }} to {{ years[years.length - 1] }} = {{ formula.sum }} {{ measurements[formula.name] }}
          </li>
        </ul>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energyConsumptionLevel' && !this.dataLoading">
      <div class="row">
        <label v-for="(prop, index) in props" :key="index" class="w-25">
          <input type="checkbox" v-model="activeProps" :value="prop" @change="chart" />
          {{ prop
            .replace(/([a-z])([A-Z])/g, '$1 $2')
            .replace(/^./, (str) => str.toUpperCase()) }}
        </label>
        <Apexchart class="w-100" :options="chartOptions" :series="chartSeries" type="line" height="600"/>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'energySavingPlan' && !this.dataLoading">
      <div class="row">
        <pre class="text">
          Модель управління енергоресурсами міста – основна складова успішного реформування енергетичного забезпечення міста,
          що відповідає за всі напрями ефективного управління енергоресурсами.

          Система дистанційного енергетичного моніторингу (СДЕМ) створюється виходячи з таких передумов:
          1. Нормативних: невідповідність процесів нормативним актам у галузі енергозабезпечення та енергозбереження.
          2. Організаційних: невідповідність вимогам ефективності організації розподілу між суб'єктами сфер відповідальності за здійснення процесів.
          3. Технічних: невідповідність фактичних експлуатаційних характеристик обладнання вимогам надійності та ефективності,
             обліку та планування вимогам точності й несуперечності.
          4. Економічних: наявність невиправданих витрат у сфері енергозабезпечення.

          Передумови передбачають такі цілі створення СДЕМ:
          - підвищення надійності, безпеки та ефективності забезпечення енергетичними ресурсами населення, об'єктів міського господарства,
            промислових підприємств та інших споживачів;
          - підвищення ефективності управління ПЕР, скорочення витрат енергоресурсів та
            бюджету міста на забезпечення енергетичними ресурсами громадських установ міського підпорядкування;
          - формування та реалізація енергетичної політики міста,
            включаючи моніторинг виконання програм та проектів енергозбереження суб'єктами – учасниками програм з енергозбереження.

          Реалізація запланованих цілей забезпечує досягнення таких показників підвищення ефективності управління енергозабезпеченням
          та енергозбереженням за рахунок автоматизації
          - використання підсистеми управління проектами у сфері енергозбереження дозволить підвищити контроль за ходом їх реалізації та фінансування;
          - використання підсистеми обліку енергетичних ресурсів дозволить забезпечити вихідні дані для контролю показників фактичного виконання програм з енергозбереження;
          - використання підсистеми диспетчерського управління дозволить підвищити надійність та безаварійність енергопостачання;
          - використання підсистеми ведення нормативно-довідкової
            інформації дозволить здійснювати облік елементів міського енергогосподарства, необхідний для підтримки збору даних
            і розрахунку фактичних показників програм енергозбереження;
          - використання підсистеми моніторингу ефективності енергопостачання дозволить здійснювати контроль показників фактичного виконання програм енергозбереження.


          Процеси, що підлягають повній або частковій автоматизації за допомогою СДЕМ:

          1. Процеси в галузі забезпечення енергоресурсами:
          - моніторинг розподілу енергоносіїв (виробництво, розподіл, збут, споживання); - формування паливно-енергетичних балансів;
          - моніторинг технічного стану інфраструктури енергозабезпечення (номінальні характеристики, режими використання, навантаження);
          - моніторинг статусу використання інфраструктури (використовується, резерв, на ремонті, аварія тощо).

          2. Процеси в галузі енергозбереження:
          - планування та моніторинг виконання програм з енергозбереження;
          - планування та моніторинг досягнення цільових показників у області енергозбереження;
          - планування та моніторинг результативності заходів у сфері енергозбереження;
          - планування та моніторинг забезпечення оснащеності приладами обліку;
          - планування та моніторинг проведення енергетичних обстежень.

          3. Процеси управління в області енергозабезпечення та енергозбереження:
          - планування та контроль інвестицій у області енергозабезпечення та енергозбереження;
          - управління проектами.

          4. Забезпечення процесів в області енергозабезпечення та енергозбереження:
          - інформаційне забезпечення в галузі енергозбереження;
          - документальне забезпечення управління (інформаційної взаємодії) у рамках автоматизованих процесів.

          5. Процеси, підконтрольні відділу з питань енергоменеджменту та впровадження енергозберігаючих технологій виконкому міської ради:
          - планування та контроль діяльності відділу; - управління організаційно-розпорядчою документацією.
            Заходи зі створення, упровадження та експлуатації СДЕМ включають створення:
            - модуля оперативно-інформаційного комплексу диспетчерського управління об'єктами;
            - модуля автоматизованого управління технічним обслуговуванням і ремонтом на об'єктах енергозбереження;
            - модуля збору даних з приладів обліку тепла, води, газу;
            - модуля розрахунку балансів, втрат на об'єктах енергозбереження;
            - модуля планування енергоспоживання й тарифної політики;
            - модуля розрахунку фактичних значень показників проектів з енергозбереження та звірки з плановими значеннями;
            - модуля розробки програм з енергозбереження та оцінки ефективності їх виконання;
            - модуля автоматизованого моніторингу та аналізу енергосервісних послуг на об'єктах;
            - розподіленої апаратно-програмної інфраструктури резервування СДЕМ;
            - системи моніторингу функціонування, системного адміністрування та технічного обслуговування СДЕМ;
            - багаторівневої системи забезпечення інформаційної безпеки СДЕМ.
          </pre>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'recommendations' && !this.dataLoading">
      <div class="row">
        <pre class="text">

  Аналіз регуляторної та нормативно-правової бази в галузі енергозбереження, у тому числі зарубіжної, для підготовки пропозицій та пакетів документів щодо її вдосконалення.

  Розробка проектів і пакетів регуляторних документів та нормативно-правових актів міста Кривого Рогу, а саме:
  - проведення енерготехнологічних обстежень і енергетичної паспортизації об'єктів споживання, виробництва та розподілу енергоресурсів;
  - порядку складання та ведення паливно-енергетичних балансів і планів енергетичного розвитку міста Кривого Рогу;
  - створення системи управління ПДСЕР, включаючи створення системи моніторингу та контролю за реалізацією заходів з енергозбереження;
  - порядок обліку і перерозподілу вивільненої в процесі реалізації енергозберігаючих заходів приєднаної потужності;
  - удосконалення нормативно-правової бази енергозбереження при виробництві, передачі та споживанні енергоресурсів;
  - упровадження та розвитку практики енергосервісних контрактів у бюджетній сфері та розвитку державно-приватного партнерства;
  - упровадження та розвиток правових і фінансових механізмів, що передбачають можливість компенсації інвесторам та іншим особам за скорочення викидів оксиду вуглецю в рамках Кіотського протоколу та одержаної економії в рамках енергосервісного контракту

  Очікувані результати: створення необхідних правових умов для розвитку енергозбереження та залучення до процесу енергозбереження всіх груп споживачів

  Перелік рекомендованих енергоефективних заходів:
  ˗ утеплення зовнішніх стін мінеральною ватою товщиною 100 - 120 мм;
  ˗ утеплення даху мінеральною ватою (150 мм);
  ˗ заміна дерев’яних вікон на склопакети класу А (Umin=1,33 Вт/(м2 ∙К); ˗ заміна або утеплення вхідних дверей;
  ˗ балансування внутрішніх систем опалення або їх повна реконструкція; ˗ установлення автоматизованих індивідуальних теплових пунктів;
  ˗ ізоляція трубопроводів внутрішніх мереж теплопостачання, що розміщені в неопалювальних приміщеннях.

  Програмні заходи також можна реалізовані за такими напрямами:
    1. Організація пропаганди енергозбереження для ефективного впливу на споживачів енергоресурсів за принципом інформаційної хвилі. При цьому вирішуються два завдання: мотивація до економії й пропозиція конкретних дій для її досягнення.
    2. Активне формування енергоощадливої свідомості населення й престижу економного ставлення до енергоресурсів у суспільстві.
    3. Надання в простих і доступних формах інформації про способи енергозбереження в побуті, переваги енергозберігаючих технологій та обладнання, особливості їх вибору й експлуатації.
    4. Залучення до процесу енергозбереження всіх соціальних верств населення міста, громадських організацій, енергосервісних компаній, організацій співвласників багатоквартирних будинків (надалі - ОСББ) та житловобудівельних кооперативів (надалі - ЖБК), які в першу чергу мають потребу в інформації про можливі технічні та організаційні рішення для енергозбереження в житлових будинках, про ПДСЕР та його можливості.
    5. Проведення занять з основ енергозбереження серед учнів навчальних закладів міста, що дозволять сформувати світогляд про дбайливе використання енергії.
    6. Залучення молоді до процесу енергозбереження при проведенні молодіжних фестивалів, де здійснюється охоплення широкої аудиторії із залученням ЗМІ, що дозволить звернути увагу молоді на проблему ресурсозбереження.
    7. Щорічне проведення Тижня енергоефективності, Днів енергії.
    8. Надання інформації організаціям і підприємствам про енергозберігаючі прийоми й методи господарювання.
    9. Популяризація використання електро- та велотранспорту.
    10. Довгострокове партнерство з мережами торгівлі, закладів громадського харчування, продуктових магазинів тощо.
    11. Друк флаєрів, запрошень, розклеювання плакатів, розповсюдження банерів, пропаганда програми на чеках (друк спеціальної касової стрічки). Насамперед всі вищезазначені напрями мають на меті формування стабільного економічного та політичного клімату, дружніх відносин між суб’єктами підприємницької діяльності, споживачем та органами місцевої влади.

  Інформаційна підтримка заходів може здійснюватися з широким залученням позабюджетних джерел фінансування. Забезпечення виконання заходів передбачається реалізувати через:
  - пріоритетність вимог ефективного використання природних та енергетичних ресурсів під час провадження господарської, управлінської або іншої діяльності, пов’язаної з використанням паливно-енергетичних ресурсів;
  - здійснення державного управління у сфері ефективного використання паливно-енергетичних ресурсів з урахуванням засад державно-приватного партнерства;
  - популяризацію економічних, екологічних та соціальних переваг ефективного використання паливно-енергетичних ресурсів, підвищення рівня громадської свідомості в питаннях їх ефективного використання.

      </pre>
      </div>
    </main>

    <main class="container-fluid h-100 mb-3" v-if="this.mode === 'report' && !this.dataLoading">
      <div class="row">
        <pre class="text">
          Наявність сучасного управління системою енергетичного менеджменту на муніципальному рівні забезпечує
          дієвий контроль за споживанням енергетичних ресурсів на міському рівні. У першу чергу це
          стосується управління бюджетними установами, де є необхідність у запровадженні автоматизованого обліку та
          аналізу споживання енергоресурсів, виконанні енергоаудитів та розробки енергоефективних заходів, управлінні
          виконанням проектних робіт та влаштуванні енергозберігаючого обладнання, плануванні нових норм споживання енергоресурсів.

          Автоматизований енергомоніторинг у бюджетних установах є вкрай необхідним для забезпечення якісного та
          оперативного контролю за рівнем енергоефективності будівель та верифікації отриманої економії в результаті впровадження енергоефективних заходів.

          Тому наявність енергетичного менеджменту є одним із ключових завдань.
          За результатами проведеного аналізу ефективності роботи енергетичного менеджменту виявлено, що
          система має недоліки. Наявна система енергетичного менеджменту (надалі – СЕМ) у багатьох випадках залежить від людського фактору; відсутнє матеріальне стимулювання задіяних у енергетичному менеджменті працівників бюджетної сфери тощо.

          Для вдосконалення функціонування СЕМ пропонується скористатися досвідом міст, що мають розвинену
          систему управління споживанням енергії, набутим у пілотних містах України в процесі реалізації
          демонстраційних проектів зі створення комп’ютеризованої системи управління енерговикористанням
          для бюджетної сфери.При цьому трирівнева модель системи енергоменеджменту ("установа – галузевий підрозділ – виконком") вибудовується
          як додатковий компонент існуючої трирівневої галузевої схеми управління бюджетними установами (освіта, охорона здоров'я, культура та ін.).
          Пропоновані інновації в системі управління мають забезпечити цілісність процесів управління споживанням енергоресурсів i органічно поєднати їх з традиційними видами управлінської діяльності, такими як: управління фінансами, кадрами тощо.

          Функціонування удосконаленої СЕМ передбачається на базі існуючого відділу з питань енергоменеджменту та впровадження енергозберігаючих технологій виконкому міської ради. Його метою є сприяння сталому енергетичному розвитку міста, здійснення системного підходу до підвищення енергоефективності інфраструктури міста шляхом:
            - керування енергоспоживанням об’єктів інфраструктури міста;
            - розробки та сприяння реалізації міських інвестиційних проектів та програм підвищення енергоефективності;
            - забезпечення довгострокової реалізації стратегії сталого розвитку в сфері енергоспоживання та енергоефективності міста;
            - підвищення інвестиційної привабливості міста, створення та просування інвестиційних продуктів.
          У Кривому Розі вже розпочата та триває робота з упровадження диспетчеризації в бюджетних закладах міста:
            - у 2014, 2015 роках впроваджено пілотний проект з удосконалення системи моніторингу шляхом оснащення лічильників обладнанням з
          автоматизованого збору та аналізу даних споживання теплової й електричної енергії, води;
            - у 2016 році таким обладнанням оснащено лічильники (до яких ускладнено доступ) у окремих закладах охорони здоров'я міста.
          Для забезпечення ефективного енергомоніторингу та верефікації впровадження проектів з енергозбереження в бюджетних
          будівлях заплановано продовження реалізації впровадження автоматизованої системи моніторингу споживання енергетичних ресурсів з елементами диспетчеризації в
          бюджетних закладах міста.
        </pre>
      </div>
    </main>

  </div>
</template>

<script>
import VueApexCharts from 'vue-apexcharts';

export default {
  name: "App",
  data() {
    return {
      dataLoading: true,
      data: null,
      year: null,
      month: null,
      years: [],
      months: [],
      filteredData: null,
      mode: 'stats',
      measurements: [],
      props: [],
      activeProps: [],
      chartOptions: {
        chart: {
          id: 'line-chart',
        },
        xaxis: {
          categories: [],
        },
      },
      chartSeries: [],
      energy: []
    };
  },
  components: {
    Apexchart: VueApexCharts,
  },
  watch: {
    mode(old, edit) {
      if (edit === 'energyConsumptionLevel') {
        this.chart()
      }
    }
  },
  async beforeCreate() {
    await fetch("http://localhost:8080/api/v1/manager/data")
          .then(response => response.json())
          .then(data => {
            this.data = data;
            this.filteredData = this.data;
            this.years = Object.keys(this.data).slice().sort()
            this.months = Object.keys(this.data[this.years[0]][Object.keys(this.data[this.years[0]])[0]]).slice().sort();
            this.year = this.years[0]
            this.month = this.months[0]
            this.updateFilteredData()
            this.props = Object.keys(this.data[this.year])
          })
          .catch(error => {
            console.error("Error fetching data:", error);
          });

    await fetch("http://localhost:8080/api/v1/manager/measurement")
        .then(response => response.json())
        .then(data => {
          this.measurements = data;
          this.dataLoading = false;
        })
        .catch(error => {
          console.error("Error fetching data:", error);
          this.dataLoading = false;
        });

    this.chartOptions.xaxis.categories = Object.keys(this.data).slice().sort()
    this.calculateEnergy();
  },
  methods: {
    updateFilteredData() {
      this.filteredData = this.data[this.year];
      let map = new Map();

      for (const entry in this.filteredData) {
        const monthValue = this.filteredData[entry][this.month];
        map.set(entry, monthValue);
        console.log(monthValue);
      }

      this.filteredData = map;
      console.log(this.filteredData);
    },
    chart() {
      this.chartSeries = []

      Object.keys(this.data).forEach(key => {
        let props = this.data[key];

        Object.keys(props).forEach(property => {
          if (this.activeProps.includes(property)) {
            let values = Object.values(props[property]);
            let approx = this.calculateAverage(values)
            let series = this.chartSeries.find(series => series.name === property.replace(/([a-z])([A-Z])/g, '$1 $2')
                .replace(/^./, (str) => str.toUpperCase()));

            if (series) {
              series.data.push(approx);
            } else {
              series = {
                name: property.replace(/([a-z])([A-Z])/g, '$1 $2')
                    .replace(/^./, (str) => str.toUpperCase()),
                data: [approx]
              };

              this.chartSeries.push(series);
            }
          }
        });
      });
    },
    calculateAverage(arr) {
      if (arr.length === 0) {
        return 0;
      }
      const sum = arr.reduce((acc, value) => acc + value, 0);
      return sum / arr.length;
    },
    calculateEnergy() {
      Object.keys(this.data).forEach(key => {
        let props = this.data[key];

        Object.keys(props).forEach(property => {
          if (property.includes('Consumption')) {
            let values = Object.values(props[property]);
            let sum = values.reduce((acc, value) => acc + value, 0);

            let energyEntry = this.energy.find(entry => entry.name === property);
            if (energyEntry) {
              energyEntry.sum += sum;
            } else {
              energyEntry = {
                name: property,
                sum: sum
              };

              this.energy.push(energyEntry);
            }
          }
        });
      });
    }
  }
};
</script>

<style>

@import url('https://fonts.googleapis.com/css2?family=Roboto+Condensed:ital@1&display=swap');

::-webkit-scrollbar {
  display: none;
}

#app {
  font-family: 'Roboto Condensed', sans-serif;
  font-size: 1.5rem;
}

.menu {
  font-size: 1.5rem;
}

.text {
  font-size: 1.3rem;
  font-style: italic;
  text-space: 3px;
  letter-spacing: 1px;
  word-wrap: break-word;
  white-space: pre-wrap;
  overflow-wrap: break-word;
  max-width: 100%;
}
</style>
